luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN26 */
#define IFX_VADC_ACCEN0_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN26 */
#define IFX_VADC_ACCEN0_EN26_OFF (26u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN27 */
#define IFX_VADC_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN27 */
#define IFX_VADC_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN27 */
#define IFX_VADC_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_OFF (0u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_OFF (1u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_OFF (2u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_OFF (3u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_OFF (4u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APC5 */
#define IFX_VADC_ACCPROT0_APC5_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC5 */
#define IFX_VADC_ACCPROT0_APC5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC5 */
#define IFX_VADC_ACCPROT0_APC5_OFF (5u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APC6 */
#define IFX_VADC_ACCPROT0_APC6_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC6 */
#define IFX_VADC_ACCPROT0_APC6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC6 */
#define IFX_VADC_ACCPROT0_APC6_OFF (6u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APC7 */
#define IFX_VADC_ACCPROT0_APC7_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC7 */
#define IFX_VADC_ACCPROT0_APC7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC7 */
#define IFX_VADC_ACCPROT0_APC7_OFF (7u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APEM */
#define IFX_VADC_ACCPROT0_APEM_LEN (1u)

