luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APEM */
#define IFX_VADC_ACCPROT0_APEM_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APEM */
#define IFX_VADC_ACCPROT0_APEM_OFF (15u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.APGC */
#define IFX_VADC_ACCPROT0_APGC_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.APGC */
#define IFX_VADC_ACCPROT0_APGC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.APGC */
#define IFX_VADC_ACCPROT0_APGC_OFF (31u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.API0 */
#define IFX_VADC_ACCPROT0_API0_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.API0 */
#define IFX_VADC_ACCPROT0_API0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.API0 */
#define IFX_VADC_ACCPROT0_API0_OFF (16u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.API1 */
#define IFX_VADC_ACCPROT0_API1_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.API1 */
#define IFX_VADC_ACCPROT0_API1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.API1 */
#define IFX_VADC_ACCPROT0_API1_OFF (17u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_OFF (18u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_OFF (19u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_OFF (20u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_OFF (21u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_OFF (22u)

/** \brief  Length for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_OFF (23u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_OFF (16u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_OFF (17u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_OFF (18u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_OFF (19u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_OFF (20u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_OFF (21u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_OFF (22u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_OFF (23u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_OFF (0u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_OFF (1u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_OFF (2u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_OFF (3u)

