luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_OFF (4u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_OFF (5u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_OFF (6u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_OFF (7u)

/** \brief  Length for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_LEN (1u)

/** \brief  Mask for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_OFF (15u)

/** \brief  Length for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_OFF (20u)

/** \brief  Length for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_OFF (16u)

/** \brief  Length for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_OFF (23u)

/** \brief  Length for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_LEN (4u)

/** \brief  Mask for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_OFF (0u)

/** \brief  Length for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_OFF (12u)

/** \brief  Length for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_OFF (13u)

/** \brief  Length for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_OFF (8u)

/** \brief  Length for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_OFF (15u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_OFF (8u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_LEN (2u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_OFF (0u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_OFF (3u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_OFF (2u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_OFF (9u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_OFF (5u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_OFF (7u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_OFF (16u)

/** \brief  Length for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_LEN (1u)

/** \brief  Mask for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_OFF (4u)

/** \brief  Length for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_LEN (32u)

/** \brief  Mask for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_MSK (0xffffffffu)

/** \brief  Offset for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_OFF (0u)

/** \brief  Length for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_LEN (32u)

