luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_MSK (0xffffffffu)

/** \brief  Offset for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_OFF (0u)

/** \brief  Length for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_LEN (1u)

/** \brief  Mask for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_OFF (3u)

/** \brief  Length for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_LEN (4u)

/** \brief  Mask for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_OFF (0u)

/** \brief  Length for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_LEN (4u)

/** \brief  Mask for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_OFF (4u)

/** \brief  Length for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_OFF (8u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_OFF (16u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_OFF (7u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_OFF (4u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_OFF (30u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_OFF (28u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.CALS */
#define IFX_VADC_G_ARBCFG_CALS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CALS */
#define IFX_VADC_G_ARBCFG_CALS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CALS */
#define IFX_VADC_G_ARBCFG_CALS_OFF (29u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.CHNR */
#define IFX_VADC_G_ARBCFG_CHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CHNR */
#define IFX_VADC_G_ARBCFG_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CHNR */
#define IFX_VADC_G_ARBCFG_CHNR_OFF (20u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_OFF (18u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_OFF (31u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_OFF (25u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_OFF (24u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_OFF (25u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_OFF (26u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_MSK (0x1u)

