luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_OFF (3u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_OFF (7u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_OFF (11u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_OFF (4u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_OFF (8u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_OFF (20u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_OFF (16u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_OFF (23u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_OFF (28u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_OFF (31u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_OFF (12u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_OFF (13u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_OFF (8u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_OFF (15u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_OFF (8u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_OFF (3u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_OFF (2u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_OFF (9u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_OFF (5u)

