luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_OFF (4u)

/** \brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_OFF (8u)

/** \brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_OFF (12u)

/** \brief  Length for Ifx_VADC_G_BFLS_Bits.BFC0 */
#define IFX_VADC_G_BFLS_BFC0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFLS_Bits.BFC0 */
#define IFX_VADC_G_BFLS_BFC0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFLS_Bits.BFC0 */
#define IFX_VADC_G_BFLS_BFC0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_BFLS_Bits.BFC1 */
#define IFX_VADC_G_BFLS_BFC1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFLS_Bits.BFC1 */
#define IFX_VADC_G_BFLS_BFC1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFLS_Bits.BFC1 */
#define IFX_VADC_G_BFLS_BFC1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_BFLS_Bits.BFC2 */
#define IFX_VADC_G_BFLS_BFC2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFLS_Bits.BFC2 */
#define IFX_VADC_G_BFLS_BFC2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFLS_Bits.BFC2 */
#define IFX_VADC_G_BFLS_BFC2_OFF (2u)

/** \brief  Length for Ifx_VADC_G_BFLS_Bits.BFC3 */
#define IFX_VADC_G_BFLS_BFC3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFLS_Bits.BFC3 */
#define IFX_VADC_G_BFLS_BFC3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFLS_Bits.BFC3 */
#define IFX_VADC_G_BFLS_BFC3_OFF (3u)

/** \brief  Length for Ifx_VADC_G_BFLS_Bits.BFS0 */
#define IFX_VADC_G_BFLS_BFS0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS0 */
#define IFX_VADC_G_BFLS_BFS0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS0 */
#define IFX_VADC_G_BFLS_BFS0_OFF (16u)

/** \brief  Length for Ifx_VADC_G_BFLS_Bits.BFS1 */
#define IFX_VADC_G_BFLS_BFS1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS1 */
#define IFX_VADC_G_BFLS_BFS1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS1 */
#define IFX_VADC_G_BFLS_BFS1_OFF (17u)

/** \brief  Length for Ifx_VADC_G_BFLS_Bits.BFS2 */
#define IFX_VADC_G_BFLS_BFS2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS2 */
#define IFX_VADC_G_BFLS_BFS2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS2 */
#define IFX_VADC_G_BFLS_BFS2_OFF (18u)

/** \brief  Length for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_OFF (19u)

/** \brief  Length for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_LEN (12u)

/** \brief  Mask for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_MSK (0xfffu)

/** \brief  Offset for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_LEN (12u)

/** \brief  Mask for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_MSK (0xfffu)

/** \brief  Offset for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_OFF (16u)

/** \brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_OFF (2u)

/** \brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_OFF (3u)

/** \brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_OFF (4u)

/** \brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_OFF (5u)

/** \brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV6 */
#define IFX_VADC_G_CEFCLR_CEV6_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV6 */
#define IFX_VADC_G_CEFCLR_CEV6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV6 */
#define IFX_VADC_G_CEFCLR_CEV6_OFF (6u)

/** \brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV7 */
#define IFX_VADC_G_CEFCLR_CEV7_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV7 */
#define IFX_VADC_G_CEFCLR_CEV7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV7 */
#define IFX_VADC_G_CEFCLR_CEV7_OFF (7u)

/** \brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV0 */
#define IFX_VADC_G_CEFLAG_CEV0_LEN (1u)

