luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH6 */
#define IFX_VADC_G_CHASS_ASSCH6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH6 */
#define IFX_VADC_G_CHASS_ASSCH6_OFF (6u)

/** \brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH7 */
#define IFX_VADC_G_CHASS_ASSCH7_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH7 */
#define IFX_VADC_G_CHASS_ASSCH7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH7 */
#define IFX_VADC_G_CHASS_ASSCH7_OFF (7u)

/** \brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH8 */
#define IFX_VADC_G_CHASS_ASSCH8_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH8 */
#define IFX_VADC_G_CHASS_ASSCH8_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH8 */
#define IFX_VADC_G_CHASS_ASSCH8_OFF (8u)

/** \brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH9 */
#define IFX_VADC_G_CHASS_ASSCH9_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH9 */
#define IFX_VADC_G_CHASS_ASSCH9_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH9 */
#define IFX_VADC_G_CHASS_ASSCH9_OFF (9u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.BNDSELL */
#define IFX_VADC_G_CHCTR_BNDSELL_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.BNDSELL */
#define IFX_VADC_G_CHCTR_BNDSELL_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.BNDSELL */
#define IFX_VADC_G_CHCTR_BNDSELL_OFF (4u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.BNDSELU */
#define IFX_VADC_G_CHCTR_BNDSELU_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.BNDSELU */
#define IFX_VADC_G_CHCTR_BNDSELU_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.BNDSELU */
#define IFX_VADC_G_CHCTR_BNDSELU_OFF (6u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.BNDSELX */
#define IFX_VADC_G_CHCTR_BNDSELX_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.BNDSELX */
#define IFX_VADC_G_CHCTR_BNDSELX_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.BNDSELX */
#define IFX_VADC_G_CHCTR_BNDSELX_OFF (12u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.BWDCH */
#define IFX_VADC_G_CHCTR_BWDCH_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.BWDCH */
#define IFX_VADC_G_CHCTR_BWDCH_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.BWDCH */
#define IFX_VADC_G_CHCTR_BWDCH_OFF (28u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.BWDEN */
#define IFX_VADC_G_CHCTR_BWDEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.BWDEN */
#define IFX_VADC_G_CHCTR_BWDEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.BWDEN */
#define IFX_VADC_G_CHCTR_BWDEN_OFF (30u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_G_CHCTR_CHEVMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_G_CHCTR_CHEVMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_G_CHCTR_CHEVMODE_OFF (8u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.ICLSEL */
#define IFX_VADC_G_CHCTR_ICLSEL_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.ICLSEL */
#define IFX_VADC_G_CHCTR_ICLSEL_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.ICLSEL */
#define IFX_VADC_G_CHCTR_ICLSEL_OFF (0u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.REFSEL */
#define IFX_VADC_G_CHCTR_REFSEL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.REFSEL */
#define IFX_VADC_G_CHCTR_REFSEL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.REFSEL */
#define IFX_VADC_G_CHCTR_REFSEL_OFF (11u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.RESPOS */
#define IFX_VADC_G_CHCTR_RESPOS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.RESPOS */
#define IFX_VADC_G_CHCTR_RESPOS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.RESPOS */
#define IFX_VADC_G_CHCTR_RESPOS_OFF (21u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.RESREG */
#define IFX_VADC_G_CHCTR_RESREG_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.RESREG */
#define IFX_VADC_G_CHCTR_RESREG_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.RESREG */
#define IFX_VADC_G_CHCTR_RESREG_OFF (16u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.RESTBS */
#define IFX_VADC_G_CHCTR_RESTBS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.RESTBS */
#define IFX_VADC_G_CHCTR_RESTBS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.RESTBS */
#define IFX_VADC_G_CHCTR_RESTBS_OFF (20u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.SYNC */
#define IFX_VADC_G_CHCTR_SYNC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.SYNC */
#define IFX_VADC_G_CHCTR_SYNC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.SYNC */
#define IFX_VADC_G_CHCTR_SYNC_OFF (10u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_LEN (3u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_OFF (8u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_LEN (10u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_MSK (0x3ffu)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_OFF (16u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_OFF (26u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_LEN (3u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_OFF (0u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_OFF (28u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_MSK (0x1u)

