luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_OFF (30u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_OFF (29u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_OFF (31u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR0_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR0_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR0_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR0_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR0_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR0_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR0_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR0_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR0_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR0_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR0_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR0_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR0_V_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR0_V_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR0_V_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_OFF (20u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_OFF (16u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_OFF (23u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_OFF (28u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_OFF (31u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_OFF (12u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_OFF (13u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_LEN (1u)

