luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_OFF (15u)

/** \brief  Length for Ifx_VADC_G_QINR0_Bits.ENSI */
#define IFX_VADC_G_QINR0_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR0_Bits.ENSI */
#define IFX_VADC_G_QINR0_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR0_Bits.ENSI */
#define IFX_VADC_G_QINR0_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_QINR0_Bits.EXTR */
#define IFX_VADC_G_QINR0_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR0_Bits.EXTR */
#define IFX_VADC_G_QINR0_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR0_Bits.EXTR */
#define IFX_VADC_G_QINR0_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QINR0_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QINR0_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QINR0_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QINR0_Bits.RF */
#define IFX_VADC_G_QINR0_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR0_Bits.RF */
#define IFX_VADC_G_QINR0_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR0_Bits.RF */
#define IFX_VADC_G_QINR0_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_OFF (11u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_OFF (2u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_OFF (10u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_OFF (16u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_OFF (9u)

/** \brief  Length for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_OFF (5u)

/** \brief  Length for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_OFF (7u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.DMM */
#define IFX_VADC_G_RCR_DMM_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.DMM */
#define IFX_VADC_G_RCR_DMM_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.DMM */
#define IFX_VADC_G_RCR_DMM_OFF (20u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.DRCTR */
#define IFX_VADC_G_RCR_DRCTR_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.DRCTR */
#define IFX_VADC_G_RCR_DRCTR_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.DRCTR */
#define IFX_VADC_G_RCR_DRCTR_OFF (16u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.FEN */
#define IFX_VADC_G_RCR_FEN_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.FEN */
#define IFX_VADC_G_RCR_FEN_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.FEN */
#define IFX_VADC_G_RCR_FEN_OFF (25u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.SRGEN */
#define IFX_VADC_G_RCR_SRGEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.SRGEN */
#define IFX_VADC_G_RCR_SRGEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.SRGEN */
#define IFX_VADC_G_RCR_SRGEN_OFF (31u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.WFR */
#define IFX_VADC_G_RCR_WFR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.WFR */
#define IFX_VADC_G_RCR_WFR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.WFR */
#define IFX_VADC_G_RCR_WFR_OFF (24u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV10 */
#define IFX_VADC_G_REFCLR_REV10_LEN (1u)

