luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_OFF (3u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_OFF (4u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_OFF (5u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_OFF (6u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_OFF (7u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_OFF (8u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_OFF (9u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.CHNR */
#define IFX_VADC_G_RES_CHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.CHNR */
#define IFX_VADC_G_RES_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.CHNR */
#define IFX_VADC_G_RES_CHNR_OFF (20u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.CRS */
#define IFX_VADC_G_RES_CRS_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.CRS */
#define IFX_VADC_G_RES_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.CRS */
#define IFX_VADC_G_RES_CRS_OFF (28u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.DRC */
#define IFX_VADC_G_RES_DRC_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.DRC */
#define IFX_VADC_G_RES_DRC_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.DRC */
#define IFX_VADC_G_RES_DRC_OFF (16u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.EMUX */
#define IFX_VADC_G_RES_EMUX_LEN (3u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.EMUX */
#define IFX_VADC_G_RES_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.EMUX */
#define IFX_VADC_G_RES_EMUX_OFF (25u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.FCR */
#define IFX_VADC_G_RES_FCR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.FCR */
#define IFX_VADC_G_RES_FCR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.FCR */
#define IFX_VADC_G_RES_FCR_OFF (30u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.RESULT */
#define IFX_VADC_G_RES_RESULT_LEN (16u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.RESULT */
#define IFX_VADC_G_RES_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.RESULT */
#define IFX_VADC_G_RES_RESULT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.VF */
#define IFX_VADC_G_RES_VF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.VF */
#define IFX_VADC_G_RES_VF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.VF */
#define IFX_VADC_G_RES_VF_OFF (31u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.CHNR */
#define IFX_VADC_G_RESD_CHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.CHNR */
#define IFX_VADC_G_RESD_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.CHNR */
#define IFX_VADC_G_RESD_CHNR_OFF (20u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.CRS */
#define IFX_VADC_G_RESD_CRS_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.CRS */
#define IFX_VADC_G_RESD_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.CRS */
#define IFX_VADC_G_RESD_CRS_OFF (28u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.DRC */
#define IFX_VADC_G_RESD_DRC_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.DRC */
#define IFX_VADC_G_RESD_DRC_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.DRC */
#define IFX_VADC_G_RESD_DRC_OFF (16u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.EMUX */
#define IFX_VADC_G_RESD_EMUX_LEN (3u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.EMUX */
#define IFX_VADC_G_RESD_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.EMUX */
#define IFX_VADC_G_RESD_EMUX_OFF (25u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.FCR */
#define IFX_VADC_G_RESD_FCR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.FCR */
#define IFX_VADC_G_RESD_FCR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.FCR */
#define IFX_VADC_G_RESD_FCR_OFF (30u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.RESULT */
#define IFX_VADC_G_RESD_RESULT_LEN (16u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.RESULT */
#define IFX_VADC_G_RESD_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.RESULT */
#define IFX_VADC_G_RESD_RESULT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.VF */
#define IFX_VADC_G_RESD_VF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.VF */
#define IFX_VADC_G_RESD_VF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.VF */
#define IFX_VADC_G_RESD_VF_OFF (31u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_OFF (0u)

