luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_OFF (4u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_OFF (8u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_OFF (12u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_OFF (16u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_OFF (20u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_OFF (24u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_OFF (28u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_OFF (8u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_OFF (12u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_OFF (16u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_OFF (20u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_OFF (24u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_OFF (28u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_OFF (0u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_OFF (4u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR10 */
#define IFX_VADC_G_RRASS_ASSRR10_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR10 */
#define IFX_VADC_G_RRASS_ASSRR10_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR10 */
#define IFX_VADC_G_RRASS_ASSRR10_OFF (10u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR11 */
#define IFX_VADC_G_RRASS_ASSRR11_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR11 */
#define IFX_VADC_G_RRASS_ASSRR11_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR11 */
#define IFX_VADC_G_RRASS_ASSRR11_OFF (11u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR12 */
#define IFX_VADC_G_RRASS_ASSRR12_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR12 */
#define IFX_VADC_G_RRASS_ASSRR12_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR12 */
#define IFX_VADC_G_RRASS_ASSRR12_OFF (12u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR13 */
#define IFX_VADC_G_RRASS_ASSRR13_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR13 */
#define IFX_VADC_G_RRASS_ASSRR13_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR13 */
#define IFX_VADC_G_RRASS_ASSRR13_OFF (13u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR14 */
#define IFX_VADC_G_RRASS_ASSRR14_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR14 */
#define IFX_VADC_G_RRASS_ASSRR14_MSK (0x1u)

