luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR14 */
#define IFX_VADC_G_RRASS_ASSRR14_OFF (14u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR15 */
#define IFX_VADC_G_RRASS_ASSRR15_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR15 */
#define IFX_VADC_G_RRASS_ASSRR15_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR15 */
#define IFX_VADC_G_RRASS_ASSRR15_OFF (15u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR1 */
#define IFX_VADC_G_RRASS_ASSRR1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR1 */
#define IFX_VADC_G_RRASS_ASSRR1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR1 */
#define IFX_VADC_G_RRASS_ASSRR1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR2 */
#define IFX_VADC_G_RRASS_ASSRR2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR2 */
#define IFX_VADC_G_RRASS_ASSRR2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR2 */
#define IFX_VADC_G_RRASS_ASSRR2_OFF (2u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR3 */
#define IFX_VADC_G_RRASS_ASSRR3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR3 */
#define IFX_VADC_G_RRASS_ASSRR3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR3 */
#define IFX_VADC_G_RRASS_ASSRR3_OFF (3u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR4 */
#define IFX_VADC_G_RRASS_ASSRR4_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR4 */
#define IFX_VADC_G_RRASS_ASSRR4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR4 */
#define IFX_VADC_G_RRASS_ASSRR4_OFF (4u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR5 */
#define IFX_VADC_G_RRASS_ASSRR5_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR5 */
#define IFX_VADC_G_RRASS_ASSRR5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR5 */
#define IFX_VADC_G_RRASS_ASSRR5_OFF (5u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR6 */
#define IFX_VADC_G_RRASS_ASSRR6_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR6 */
#define IFX_VADC_G_RRASS_ASSRR6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR6 */
#define IFX_VADC_G_RRASS_ASSRR6_OFF (6u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR7 */
#define IFX_VADC_G_RRASS_ASSRR7_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR7 */
#define IFX_VADC_G_RRASS_ASSRR7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR7 */
#define IFX_VADC_G_RRASS_ASSRR7_OFF (7u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR8 */
#define IFX_VADC_G_RRASS_ASSRR8_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR8 */
#define IFX_VADC_G_RRASS_ASSRR8_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR8 */
#define IFX_VADC_G_RRASS_ASSRR8_OFF (8u)

/** \brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR9 */
#define IFX_VADC_G_RRASS_ASSRR9_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR9 */
#define IFX_VADC_G_RRASS_ASSRR9_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR9 */
#define IFX_VADC_G_RRASS_ASSRR9_OFF (9u)

/** \brief  Length for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_OFF (0u)

/** \brief  Length for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_OFF (4u)

/** \brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_OFF (2u)

/** \brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_OFF (3u)

/** \brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_OFF (8u)

/** \brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_OFF (9u)

/** \brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_OFF (10u)

