luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY1 */
#define IFX_VADC_GLOBBOUND_BOUNDARY1_MSK (0xfffu)

/** \brief  Offset for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY1 */
#define IFX_VADC_GLOBBOUND_BOUNDARY1_OFF (16u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DCMSB */
#define IFX_VADC_GLOBCFG_DCMSB_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DCMSB */
#define IFX_VADC_GLOBCFG_DCMSB_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DCMSB */
#define IFX_VADC_GLOBCFG_DCMSB_OFF (7u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DIVA */
#define IFX_VADC_GLOBCFG_DIVA_LEN (5u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DIVA */
#define IFX_VADC_GLOBCFG_DIVA_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DIVA */
#define IFX_VADC_GLOBCFG_DIVA_OFF (0u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DIVD */
#define IFX_VADC_GLOBCFG_DIVD_LEN (2u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DIVD */
#define IFX_VADC_GLOBCFG_DIVD_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DIVD */
#define IFX_VADC_GLOBCFG_DIVD_OFF (8u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DIVWC */
#define IFX_VADC_GLOBCFG_DIVWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DIVWC */
#define IFX_VADC_GLOBCFG_DIVWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DIVWC */
#define IFX_VADC_GLOBCFG_DIVWC_OFF (15u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL0 */
#define IFX_VADC_GLOBCFG_DPCAL0_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL0 */
#define IFX_VADC_GLOBCFG_DPCAL0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL0 */
#define IFX_VADC_GLOBCFG_DPCAL0_OFF (16u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL1 */
#define IFX_VADC_GLOBCFG_DPCAL1_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL1 */
#define IFX_VADC_GLOBCFG_DPCAL1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL1 */
#define IFX_VADC_GLOBCFG_DPCAL1_OFF (17u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_OFF (18u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL3 */
#define IFX_VADC_GLOBCFG_DPCAL3_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL3 */
#define IFX_VADC_GLOBCFG_DPCAL3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL3 */
#define IFX_VADC_GLOBCFG_DPCAL3_OFF (19u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL4 */
#define IFX_VADC_GLOBCFG_DPCAL4_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL4 */
#define IFX_VADC_GLOBCFG_DPCAL4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL4 */
#define IFX_VADC_GLOBCFG_DPCAL4_OFF (20u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL5 */
#define IFX_VADC_GLOBCFG_DPCAL5_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL5 */
#define IFX_VADC_GLOBCFG_DPCAL5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL5 */
#define IFX_VADC_GLOBCFG_DPCAL5_OFF (21u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL6 */
#define IFX_VADC_GLOBCFG_DPCAL6_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL6 */
#define IFX_VADC_GLOBCFG_DPCAL6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL6 */
#define IFX_VADC_GLOBCFG_DPCAL6_OFF (22u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL7 */
#define IFX_VADC_GLOBCFG_DPCAL7_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL7 */
#define IFX_VADC_GLOBCFG_DPCAL7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL7 */
#define IFX_VADC_GLOBCFG_DPCAL7_OFF (23u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.LOSUP */
#define IFX_VADC_GLOBCFG_LOSUP_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.LOSUP */
#define IFX_VADC_GLOBCFG_LOSUP_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.LOSUP */
#define IFX_VADC_GLOBCFG_LOSUP_OFF (14u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.REFPC */
#define IFX_VADC_GLOBCFG_REFPC_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.REFPC */
#define IFX_VADC_GLOBCFG_REFPC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.REFPC */
#define IFX_VADC_GLOBCFG_REFPC_OFF (12u)

/** \brief  Length for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_OFF (31u)

/** \brief  Length for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_OFF (8u)

/** \brief  Length for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_OFF (24u)

/** \brief  Length for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_OFF (0u)

/** \brief  Length for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_OFF (16u)

/** \brief  Length for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_OFF (16u)

