luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_OFF (0u)

/** \brief  Length for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_LEN (4u)

/** \brief  Mask for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_OFF (16u)

/** \brief  Length for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_OFF (31u)

/** \brief  Length for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_OFF (24u)

/** \brief  Length for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_OFF (20u)

/** \brief  Length for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_LEN (2u)

/** \brief  Mask for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_OFF (28u)

/** \brief  Length for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_LEN (3u)

/** \brief  Mask for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_OFF (25u)

/** \brief  Length for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_OFF (30u)

/** \brief  Length for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_LEN (4u)

/** \brief  Mask for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_OFF (16u)

/** \brief  Length for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_LEN (16u)

/** \brief  Mask for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_OFF (0u)

/** \brief  Length for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_OFF (31u)

/** \brief  Length for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_OFF (20u)

/** \brief  Length for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_LEN (2u)

/** \brief  Mask for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_OFF (28u)

/** \brief  Length for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_LEN (3u)

/** \brief  Mask for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_OFF (25u)

/** \brief  Length for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_OFF (30u)

/** \brief  Length for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_LEN (4u)

/** \brief  Mask for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_OFF (16u)

/** \brief  Length for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_LEN (16u)

/** \brief  Mask for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_OFF (0u)

/** \brief  Length for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_OFF (31u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_LEN (4u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_OFF (0u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_OFF (8u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_LEN (4u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_OFF (4u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_LEN (2u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_MSK (0x3u)

