luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_bf.h
/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_OFF (9u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_OFF (15u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_OFF (17u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_OFF (18u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_OFF (23u)

/** \brief  Length for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_LEN (1u)

/** \brief  Mask for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_OFF (16u)

/** \brief  Length for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_LEN (3u)

/** \brief  Mask for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_OFF (24u)

/** \brief  Length for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_LEN (3u)

/** \brief  Mask for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_OFF (8u)

/** \brief  Length for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_LEN (5u)

/** \brief  Mask for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_OFF (16u)

/** \brief  Length for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_LEN (5u)

/** \brief  Mask for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_OFF (0u)

/** \brief  Length for Ifx_VADC_ID_Bits.MOD_REV */
#define IFX_VADC_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_VADC_ID_Bits.MOD_REV */
#define IFX_VADC_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_VADC_ID_Bits.MOD_REV */
#define IFX_VADC_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_VADC_ID_Bits.MOD_TYPE */
#define IFX_VADC_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_VADC_ID_Bits.MOD_TYPE */
#define IFX_VADC_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_VADC_ID_Bits.MOD_TYPE */
#define IFX_VADC_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_LEN (4u)

/** \brief  Mask for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_OFF (24u)

/** \brief  Length for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_LEN (1u)

/** \brief  Mask for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_OFF (3u)

/** \brief  Length for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_LEN (1u)

/** \brief  Mask for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_OFF (2u)

/** \brief  Length for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_LEN (2u)

/** \brief  Mask for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_OFF (0u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXVADC_BF_H */
